export const REPORT_REASONS = [
  { value: 'Ненормативна лексика', label: 'Ненормативна лексика' },
  { value: 'Образа або неповага', label: 'Образа або неповага' },
  { value: 'Погрози, шантаж або цькування', label: 'Погрози, шантаж або цькування' },
  { value: 'Неприйнятний контент', label: 'Неприйнятний контент' },
  { value: 'Порушення академічної доброчесності', label: 'Порушення академічної доброчесності' },
  { value: 'Спам або підозрілі посилання', label: 'Спам або підозрілі посилання' },
];
