export const NUS_GROUPS_CONFIG: Record<string, string[]> = {
  'Українська мова': [
    'ГР 1. Взаємодія з іншими особами усно, сприймання і використання інформації для досягнення життєвих цілей у різних комунікативних ситуаціях',
    'ГР 2. Сприймання, аналіз, інтерпретація, критичне оцінювання інформації в текстах різних видів (зокрема художніх текстах, медіатекстах) та використання її для збагачення власного досвіду',
    'ГР 3. Висловлювання думок, почуттів і ставлень, письмова взаємодія з іншими особами, взаємодія з іншими особами у цифровому середовищі, дотримання норм літературної мови',
    'ГР 4. Дослідження індивідуального мовлення, використання мови для Власної мовної творчості, спостереження за мовними та літературними явищами, проведення їх аналізу',
  ],
  'Українська література': [
    'ГР 1. Усно взаємодіє',
    'ГР 2. Працює з текстом',
    'ГР 3. Письмово взаємодіє',
    'ГР 4. Досліджує мовлення',
  ],
  'Зарубіжна література': [
    'ГР 1. Усно взаємодіє',
    'ГР 2. Працює з текстом',
    'ГР 3. Письмово взаємодіє',
    'ГР 4. Досліджує мовлення',
  ],
  'Англійська мова': [
    'ГР 1. Сприйняття усної інформації та письмових текстів іноземною мовою в умовах безпосереднього та опосередкованого міжкультурного спілкування',
    'ГР 2. Взаємодія з іншими особами в усній і письмовій формі та в режимі реального пасу через засоби іноземної мови',
    'ГР 3. Надання інформації, висловлювання думок, почуттів та ставлення іноземною мовою',
  ],
  Математика: [
    'ГР 1. Досліджує ситуації та створює математичні моделі',
    'ГР 2. Розв’язує математичні задачі',
    'ГР 3. Інтерпретує та критично аналізує результати',
  ],
  Алгебра: [
    'ГР 1. Досліджує ситуації та створює математичні моделі',
    'ГР 2. Розв’язує математичні задачі',
    'ГР 3. Інтерпретує та критично аналізує результати',
  ],
  Геометрія: [
    'ГР 1. Досліджує ситуації та створює математичні моделі',
    'ГР 2. Розв’язує математичні задачі',
    'ГР 3. Інтерпретує та критично аналізує результати',
  ],
  'Історія України': [
    'ГР 1. Орієнтується в історичному часі та просторі, виявляє взаємозв’язки подій і явищ',
    'ГР 2. Працює з інформацією історичного та суспільствознавчого змісту',
    'ГР 3. Виявляє здатність до співпраці, толерантність, громадянську позицію',
  ],
  'Всесвітня історія': [
    'ГР 1. Орієнтується в історичному часі та просторі, виявляє взаємозв’язки подій і явищ',
    'ГР 2. Працює з інформацією історичного та суспільствознавчого змісту',
    'ГР 3. Виявляє здатність до співпраці, толерантність, громадянську позицію',
  ],
  Біологія: [
    'ГР 1. Проводить дослідження природи',
    'ГР 2. Здійснює пошук та опрацьовує інформацію',
    'ГР 3. Усвідомлює закономірності природи',
  ],
  Фізика: [
    'ГР 1. Проводить дослідження природи',
    'ГР 2. Здійснює пошук та опрацьовує інформацію',
    'ГР 3. Усвідомлює закономірності природи',
  ],
  Хімія: [
    'ГР 1. Проводить дослідження природи',
    'ГР 2. Здійснює пошук та опрацьовує інформацію',
    'ГР 3. Усвідомлює закономірності природи',
  ],
  Географія: [
    'ГР 1. Проводить дослідження природи',
    'ГР 2. Здійснює пошук та опрацьовує інформацію',
    'ГР 3. Усвідомлює закономірності природи',
  ],
  Інформатика: [
    'ГР 1. Працює з інформацією, даними, моделями',
    'ГР 2. Створює інформаційні продукти',
    'ГР 3. Працює в цифровому середовищі',
    'ГР 4. Безпечно та відповідально працює з інформаційними технологіями',
  ],
  'Фізична культура': [
    'ГР 1. Формування психічної та соціально-психологічної сфер засобами фізичного виховання',
    'ГР 2. Систематичні заняття фізичними вправами, володіння технікою фізичних вправ',
    'ГР 3. Усвідомлення значення фізичної/рухової активності для підтримування стану здоров’я та задоволення у процесі фізичного виховання',
  ],
  Мистецтво: [
    'ГР 1. Пізнання мистецтва, художнє мислення',
    'ГР 2. Художньо-творча діяльність, мистецька комунікація',
    'ГР 3. Емоційний досвід, художньо-естетичне ставлення',
  ],
  'Основи здоров’я': [
    'ГР 1. Безпека. Уникання загроз для життя власного та інших осіб, прийняття рішень з користю для власної та громадської безпеки',
    'ГР 2. Здоров’я. Турбота про особисте здоров’я. Аргументований вибір здорового способу життя.',
    'ГР 3. Добробут. Підприємливість та етична поведінка для поліпшення добробуту',
  ],
  'Трудове навчання': [
    'ГР 1. Втілення задуму в готовий продукт за алгоритмом проектно-технологічної діяльності',
    'ГР 2. Творче застосування традиційних і сучасних технологій декоративно-ужиткового мистецтва',
    'ГР 3. Ефективне використання техніки і матеріалів без заподіяння шкоди навколишньому середовищу',
    'ГР 4. Турбота про власний побут, задоволення власних потреб і потреб інших осіб',
  ],
  'Я досліджую світ': [
    'ГР 1. Проводить дослідження природи',
    'ГР 2. Здійснює пошук та опрацьовує інформацію',
    'ГР 3. Усвідомлює закономірності природи',
  ],
};
